"что такое ООП ?"
    `ООП - это... парадигма программированиия/подход к програмиированиию, описывающий:
        что программа должна состоять из отдельных, независимых компонентов взаимодействующих друг с другом
        при помощи своего публичного интерфейса  
    

                                "Принципы ООП"



    "Наследование"                  "Инкапсуляция"              "Полиморфизм"

    

"Основные концепции ООП" : Класс Объект
"Класс"
    Класс – это модель ещё не существующей сущности (объекта). 
    Класс фактически описывает устройство объекта, являясь своего рода чертежом.
    Чем отличается класс от объекта? 
    Класс – это тип данных, а объект – экземпляр типа класс.
    
"Объект"
    Объект – это совокупность данных и методов для их обработки. 
    Данные и методы называются членами класса. Вообще, объектом является все то, что поддерживает инкапсуляцию.


    Абстрактный класс ... 
    Абстрактные классы реализуют на практике один из принципов ООП — полиморфизм. 
    Абстрактный класс может содержать (и не содержать) абстрактные методы и свойства. 
    Абстрактный метод не реализуется для класса, в котором описан, однако должен быть реализован для его неабстрактных потомков.
`